# import pandas

In [92]:
import pandas as pd

### explain callable format

In [93]:
pd.options.display.float_format = '{:,.0f}'.format

<blockquote>

f is a method object bound to a string instance

the format method is bound to a `str('{:,.0f}')` object

when passed as an argument and called, it remebers the self argument

the original self object can be retrieved via the `__self__`attribute
</blockquote>

In [94]:
f = '{:,.0f}'.format
f'{f.__self__ = }'

"f.__self__ = '{:,.0f}'"

# import excel file

In [95]:
df = pd.read_excel('advworksdata.xlsx')
df.head() # first 5

,productcategory,productsubcategory,product,saleterritory,Country,City,Sate,Customer,Employee,OrderCount,OrderDate,StandardCost,UnitPrice,UnitPriceDiscount,Discount,ListPrice,SaleswithStandard,NetSales,OrderQuantity,Sales
0,Clothing,Caps,AWC Logo Cap,United Kingdom,United Kingdom,Berks,England,Gary Suess,Amy Alberts,1,2012-06-30,7,5,0,1,9,97,-28,14,69
1,Accessories,Locks,Cable Lock,United Kingdom,United Kingdom,Berks,England,Gary Suess,Amy Alberts,1,2012-06-30,10,15,0,0,25,62,28,6,90
2,Clothing,Gloves,"Full-Finger Gloves, L",United Kingdom,United Kingdom,Berks,England,Gary Suess,Amy Alberts,1,2012-06-30,16,23,0,0,38,125,57,8,182
3,Clothing,Gloves,"Full-Finger Gloves, L",United Kingdom,United Kingdom,London,England,Linda Martin,Amy Alberts,1,2012-06-30,16,21,0,17,38,251,67,16,318
4,Clothing,Gloves,"Full-Finger Gloves, M",United Kingdom,United Kingdom,Berks,England,Gary Suess,Amy Alberts,1,2012-06-30,16,23,0,0,38,110,50,7,160

## check dataframe properties

#### show dataframe type

In [96]:
type(df)

pandas.core.frame.DataFrame

### check if dataframe is empty

In [97]:
df.empty

False

### show dataframe shape

> shape is shown in (rows, columns)

In [98]:
df.shape

(60880, 20)

### get list of columns

In [99]:
df.columns

Index(['productcategory', 'productsubcategory', 'product', 'saleterritory',
       'Country', 'City', 'Sate', 'Customer', 'Employee', 'OrderCount',
       'OrderDate', 'StandardCost', 'UnitPrice', 'UnitPriceDiscount',
       'Discount', 'ListPrice', 'SaleswithStandard', 'NetSales',
       'OrderQuantity', 'Sales'],
      dtype='object')

# work with dataframe

## modify metadata

### rename columns

In [100]:
df = df.rename(columns=str.lower)
df[0:3].sort_index(axis=1, ascending=False)
df.head()

,productcategory,productsubcategory,product,saleterritory,country,city,sate,customer,employee,ordercount,orderdate,standardcost,unitprice,unitpricediscount,discount,listprice,saleswithstandard,netsales,orderquantity,sales
0,Clothing,Caps,AWC Logo Cap,United Kingdom,United Kingdom,Berks,England,Gary Suess,Amy Alberts,1,2012-06-30,7,5,0,1,9,97,-28,14,69
1,Accessories,Locks,Cable Lock,United Kingdom,United Kingdom,Berks,England,Gary Suess,Amy Alberts,1,2012-06-30,10,15,0,0,25,62,28,6,90
2,Clothing,Gloves,"Full-Finger Gloves, L",United Kingdom,United Kingdom,Berks,England,Gary Suess,Amy Alberts,1,2012-06-30,16,23,0,0,38,125,57,8,182
3,Clothing,Gloves,"Full-Finger Gloves, L",United Kingdom,United Kingdom,London,England,Linda Martin,Amy Alberts,1,2012-06-30,16,21,0,17,38,251,67,16,318
4,Clothing,Gloves,"Full-Finger Gloves, M",United Kingdom,United Kingdom,Berks,England,Gary Suess,Amy Alberts,1,2012-06-30,16,23,0,0,38,110,50,7,160

### rename dataframe columns

> provide a dictionary with the following structure:

    {abc:def}

In [101]:
df = df.rename(columns={
    'productcategory': 'category',
    'saleterritory': 'territory',
    'productsubcategory': 'subcategory',
    'orderquantity': 'quantity',
    'orderdate': 'date',
    'sate': 'state'
}, errors='raise')
df.head()

,category,subcategory,product,territory,country,city,state,customer,employee,ordercount,date,standardcost,unitprice,unitpricediscount,discount,listprice,saleswithstandard,netsales,quantity,sales
0,Clothing,Caps,AWC Logo Cap,United Kingdom,United Kingdom,Berks,England,Gary Suess,Amy Alberts,1,2012-06-30,7,5,0,1,9,97,-28,14,69
1,Accessories,Locks,Cable Lock,United Kingdom,United Kingdom,Berks,England,Gary Suess,Amy Alberts,1,2012-06-30,10,15,0,0,25,62,28,6,90
2,Clothing,Gloves,"Full-Finger Gloves, L",United Kingdom,United Kingdom,Berks,England,Gary Suess,Amy Alberts,1,2012-06-30,16,23,0,0,38,125,57,8,182
3,Clothing,Gloves,"Full-Finger Gloves, L",United Kingdom,United Kingdom,London,England,Linda Martin,Amy Alberts,1,2012-06-30,16,21,0,17,38,251,67,16,318
4,Clothing,Gloves,"Full-Finger Gloves, M",United Kingdom,United Kingdom,Berks,England,Gary Suess,Amy Alberts,1,2012-06-30,16,23,0,0,38,110,50,7,160

## get subset of dataframe

### get one column

In [102]:
# df['product'].head()
df['product'][0:5]

0             AWC Logo Cap
1               Cable Lock
2    Full-Finger Gloves, L
3    Full-Finger Gloves, L
4    Full-Finger Gloves, M
Name: product, dtype: object

### get more columns

In [103]:
#  pass a list of column names to filter
df[['category','product']][0:3]

      category                product
0     Clothing           AWC Logo Cap
1  Accessories             Cable Lock
2     Clothing  Full-Finger Gloves, L

### limit columns of dataframe

In [104]:
df.columns

Index(['category', 'subcategory', 'product', 'territory', 'country', 'city',
       'state', 'customer', 'employee', 'ordercount', 'date', 'standardcost',
       'unitprice', 'unitpricediscount', 'discount', 'listprice',
       'saleswithstandard', 'netsales', 'quantity', 'sales'],
      dtype='object')

In [105]:
df = df['category subcategory product date listprice quantity sales'.split()]
df.head()

,category,subcategory,product,date,listprice,quantity,sales
0,Clothing,Caps,AWC Logo Cap,2012-06-30,9,14,69
1,Accessories,Locks,Cable Lock,2012-06-30,25,6,90
2,Clothing,Gloves,"Full-Finger Gloves, L",2012-06-30,38,8,182
3,Clothing,Gloves,"Full-Finger Gloves, L",2012-06-30,38,16,318
4,Clothing,Gloves,"Full-Finger Gloves, M",2012-06-30,38,7,160

## work with dataframe data types

### show dataframe columns data types

In [106]:
df.dtypes

category               object
subcategory            object
product                object
date           datetime64[ns]
listprice             float64
quantity                int64
sales                 float64
dtype: object

### convert column data type

In [107]:
df['date'] = pd.to_datetime(df['date'])
df['date'].head()

0   2012-06-30
1   2012-06-30
2   2012-06-30
3   2012-06-30
4   2012-06-30
Name: date, dtype: datetime64[ns]

### raise error when trying to convert NANs (NULLs)

In [109]:
try:
    df['listprice'] = df['listprice'].astype(int)
except Exception as e:
    print(repr(e))

IntCastingNaNError('Cannot convert non-finite values (NA or inf) to integer')

## fixing NULL values

### check whether there are columns containing nulls (nans)

In [58]:
df.isnull().any()

category        True
subcategory     True
product         True
date           False
listprice       True
quantity       False
sales          False
dtype: bool

### count null values per columns

In [59]:
df.isnull().sum()

category       39
subcategory    39
product        39
date            0
listprice      39
quantity        0
sales           0
dtype: int64

### fill column null values with custom values

In [60]:
# df['category'].fillna('unknown', inplace=True)  # deprecated in pandas 3.0
df.category = df['category'].fillna('unknown')
df.fillna({'category':'unknown'}, inplace=True)
df[df.category == 'unknown'].head()

      category subcategory product       date  listprice  quantity  sales
581    unknown         NaN     NaN 2014-02-28        NaN         2    117
582    unknown         NaN     NaN 2014-02-28        NaN         1    564
42825  unknown         NaN     NaN 2013-05-30        NaN         2    117
42826  unknown         NaN     NaN 2013-05-30        NaN         2  1,128
42827  unknown         NaN     NaN 2013-05-30        NaN         2    528

In [61]:
df.fillna({'subcategory':'unknown'}, inplace=True)

In [62]:
df.fillna({'category':0}, inplace=True)

## selecting values

In [63]:
df.category.unique()

array(['Clothing', 'Accessories', 'Components', 'Bikes', 'unknown'],
      dtype=object)

In [64]:
df.sales.sum()

np.float64(80487704.17918801)

In [65]:
df.quantity.count()

np.int64(60880)

## slicing with loc and iloc

### select columns and records

<blockquote>
pass a list of columns to filter columns

slice the record containing the resulting columns

[from-included:to-excluded]
</blockquote>

In [66]:
df[['category', 'date', 'sales']][10:13]

      category       date  sales
10    Clothing 2012-06-30     42
11  Components 2012-06-30    826
12  Components 2012-06-30    150

In [67]:
# df[10:13]['category'] = df[10:13]['category'].str.lower()     # deprecated in pandas 3.0

# Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.
df.loc[10:13, 'category'] = df.loc[10:13, 'category'].str.lower()
df[10:13]['category']

10      clothing
11    components
12    components
Name: category, dtype: object

## test loc syntax

### single row
>use index position

> returns a series

In [84]:
single_row = df.loc[10]
type(single_row)

pandas.core.series.Series

In [85]:
single_row

category                    clothing
subcategory                   Gloves
product        Half-Finger Gloves, S
date             2012-06-30 00:00:00
listprice                         24
quantity                           3
sales                             42
Name: 10, dtype: object

### slice of rows
> use start and stop indexes

> returns dataframe with both start and stop included

In [86]:
rows = df.loc[0:5]
type(rows)

pandas.core.frame.DataFrame

In [87]:
rows

,category,subcategory,product,date,listprice,quantity,sales
0,Clothing,Caps,AWC Logo Cap,2012-06-30,9,14,69
1,Accessories,Locks,Cable Lock,2012-06-30,25,6,90
2,Clothing,Gloves,"Full-Finger Gloves, L",2012-06-30,38,8,182
3,Clothing,Gloves,"Full-Finger Gloves, L",2012-06-30,38,16,318
4,Clothing,Gloves,"Full-Finger Gloves, M",2012-06-30,38,7,160
5,Clothing,Gloves,"Full-Finger Gloves, M",2012-06-30,38,2,46

### select rows and one column

In [88]:
df.loc[0:5, 'category']

0       Clothing
1    Accessories
2       Clothing
3       Clothing
4       Clothing
5       Clothing
Name: category, dtype: object

### select rows and more columns

In [91]:
df.loc[0:5, ['category', 'listprice']]

      category  listprice
0     Clothing          9
1  Accessories         25
2     Clothing         38
3     Clothing         38
4     Clothing         38
5     Clothing         38







# BREAK
<br/>
<br/>
<br/>
<br/>
<br/>
<br/>
<br/>
<br/>
<br/>
<br/>
<br/>
<br/>
<br/>
<br/>
<br/>
<br/>
<br/>
<br/>
<br/>
<br/>
<br/>
<br/>
<br/>

---

In [28]:
df[df.category.name]
type(df.category.name)

str

### select records

<blockquote>
slice the dataframe records

[from-included:to-excluded]
</blockquote>

In [29]:
df[10:13]

,category,subcategory,product,date,listprice,quantity,sales
10,clothing,Gloves,"Half-Finger Gloves, S",2012-06-30,24,3,42
11,components,Forks,HL Fork,2012-06-30,229,6,826
12,components,Headsets,HL Headset,2012-06-30,125,2,150

In [30]:
df.columns

Index(['category', 'subcategory', 'product', 'date', 'listprice', 'quantity',
       'sales'],
      dtype='object')

### select records and column

In [31]:
df[10:13]['category'].str.lower()

10      clothing
11    components
12    components
Name: category, dtype: object

> same thing, just swapped selectors

In [32]:
df['category'][10:13].str.lower()

10      clothing
11    components
12    components
Name: category, dtype: object

In [33]:
df[0:3]

,category,subcategory,product,date,listprice,quantity,sales
0,Clothing,Caps,AWC Logo Cap,2012-06-30,9,14,69
1,Accessories,Locks,Cable Lock,2012-06-30,25,6,90
2,Clothing,Gloves,"Full-Finger Gloves, L",2012-06-30,38,8,182

## other

### pivot

In [34]:
df.T.head(3)

,0,1,2,3,4,5,6,7,8,9,...,60870,60871,60872,60873,60874,60875,60876,60877,60878,60879
category,Clothing,Accessories,Clothing,Clothing,Clothing,Clothing,Clothing,Clothing,Clothing,Clothing,...,Bikes,Bikes,Bikes,Accessories,Clothing,Clothing,Clothing,Clothing,Clothing,Clothing
subcategory,Caps,Locks,Gloves,Gloves,Gloves,Gloves,Gloves,Gloves,Gloves,Gloves,...,Touring Bikes,Touring Bikes,Touring Bikes,Bottles and Cages,Shorts,Shorts,Shorts,Shorts,Shorts,Shorts
product,AWC Logo Cap,Cable Lock,"Full-Finger Gloves, L","Full-Finger Gloves, L","Full-Finger Gloves, M","Full-Finger Gloves, M","Full-Finger Gloves, S","Full-Finger Gloves, S","Half-Finger Gloves, L","Half-Finger Gloves, M",...,"Touring-3000 Yellow, 62","Touring-3000 Yellow, 62","Touring-3000 Yellow, 62",Water Bottle - 30 oz.,"Women's Mountain Shorts, L","Women's Mountain Shorts, L","Women's Mountain Shorts, L","Women's Mountain Shorts, M","Women's Mountain Shorts, S","Women's Mountain Shorts, S"